import React from "react";
import { Typography } from "@material-ui/core";

const AboutGroup = () => `
הקבוצה הזו היא קבוצת הכלבים באיכותית ביותר הקיימת היום בפייסוש, ולא לחינם.
אנחנו מקפידות באדיקות על כך שגישת הקבוצה תישמר בפוסטים ובתגובות כאן, כלפי כלבים וכלפי אנשים.
אך מה היא בכלל גישת הקבוצה???
או. אז טוב ששאלתם ☺
אני כאן כדי להסביר.
לכאורה הגישה היא מה שמכונה בלשון העם 'אילוף חיובי' או 'פורס פרי', אך בפועל היא מקדמת רעיון הרבה יותר גדול מאילו.
בעוד שני השמות שציינתי למעלה מתייחסים לגישות עבודה אילופית עם כלבים, ומתמקדות בפן טכני יחסית של תהליך הלמידה של הכלב, גישת הקבוצה שלנו היא הוליסטית יותר. 
רגע רגע אל תברחו, אלו לא קשקושי ניו אייג' אני מבטיחה!
`;

const AboutModerators = () => `
עבודה התנהגותית עם כלבים היא רק פן אחד בתהליך טיפולי עם כלב רגיש והבעלים שלו. אנחנו יוצאות מנקודת הנחה שלרגישויות של הכלבים שלנו יש כל מיני סיבות ומקורות, ועל מנת לקדם אותו עלינו להסתכל עליו כמכלול.
היבטי ההסתכלות הם כמעט על כל אספקט בחייו של הכלב הרגיש, וביניהם- גנטיקה, פיזיולוגיה, תזונה, סביבה, תקשורת ומערכות יחסים שהוא מנהל ביומיום שלו ועוד.
האמצעים שהגישה מקדמת בתהליכים עם הכלבים שלנו הם: תזונה מתאימה והקפדה על בריאות הכלב, שימוש בתיאוריות למידה מתקדמות ששמות דגש על רווחת הכלב, הבנה של צרכי הכלב והבנה כיצד לענות עליהם בכדי ליצור אצלו נוחות וסיפוק, העדפה של אביזרים ידידותיים לכלבים כמו רתמות, עבודה התנהגותית לפי המסוגלות של הכלב ושאיפה להביא אותו להצלחה ולא לכשלון,  שימוש באוכל או בצעצוע לפי הצורך בכדי לתגמל התנהגויות.
אנחנו רוצות להביא למצב שהחיים של הכלבים הרגישים שלכם משתפרים בכל האספקטים האלו (לפחות אלו שניתנים להשפעה ובמידת האפשר) וכתוצאה מכך הרגישויות שלהם יורדות. ועל כן אנחנו שואפות להביא לכם ידע מתקדם בתחומים אלו ומיטב אנשי המקצוע המודרניים נמצאים כאן בכדי לענות לשאלותיכם ולתת לכם ערך.

`;

function Article({ name }) {
  return (
    <Typography variant="body1" style={{ fontSize: "1.5em" }}>
      {name === "about-group" ? AboutGroup() : AboutModerators()}
    </Typography>
  );
}

export default Article;
